{
  "Home": "الرئيسية",
  "About Us": "من نحن",
  "Services": "خدماتنا",
  "Our Team": "فريقنا",
  "Portfolio": "أعمالنا",
  "Contact Us": "اتصل بنا",
  "Your Vision,": "رؤيتــــــــك،",
  "Our Expertise": "خبرتنــــــــا",
  "We provide you with programming solutions and website and application design": "نقدم لك الحلول البرمجية وتصميم المواقع والتطبيقات.",
  "Follow us on": "تابعونا على:",
  "Freelance team software": "تيم برمجيات فريلانسر",
  "Progo is a team of experienced software engineers specializing in designing and developing custom software solutions, including websites, mobile applications, and enterprise management systems, The team excels in delivering innovative and advanced software solutions tailored to meet clients' needs and help them achieve their goals efficiently and effectively": "Progo هو فريق من مهندسي البرمجيات ذوي الخبرة والمتخصصين في تصميم وتطوير الحلول البرمجية المخصصة، بما في ذلك مواقع الويب وتطبيقات الهاتف المحمول وأنظمة إدارة المؤسسات. يتفوق الفريق في تقديم حلول برمجية مبتكرة ومتقدمة مصممة لتلبية احتياجات العملاء ومساعدتهم على تحقيق أهدافهم بكفاءة وفعالية.",
  "Read more": "اقرا اكثر",
  "Our values": "قيمنــــــا",
  "The Heart and Values Driving Our Journey": "القلب والقيم التي تقود رحلتنا",
  "Quality": "الجودة",
  "At Progo, we believe that quality is not just a standard but an ingrained philosophy in our daily work, We are committed to providing world-class products and services that meet our customers aspirations and add value to their businesses": "في بروجو، نؤمن أن الجودة ليست مجرد معيار، بل هي فلسفة متأصلة في عملنا اليومي. نحن ملتزمون بتقديم منتجات وخدمات عالمية المستوى تلبي تطلعات عملائنا وتضيف قيمة إلى أعمالهم.",
  "Teamwork": "العمل الجماعي",
  "We believe that teamwork is the cornerstone of success, Through collaboration, we combine expertise and skills to deliver the best solutions and achieve our clients goals effectively": "نؤمن أن العمل الجماعي هو حجر الزاوية للنجاح. من خلال التعاون، ندمج الخبرات والمهارات لتقديم أفضل الحلول وتحقيق أهداف عملائنا بفعالية.",
  "Excellence": "التميز",
  "We place excellence at the core of everything we do, always striving to deliver innovative solutions that provide real value to our clients and exceed their expectations": "نضع التميز في قلب كل ما نقوم به، ونسعى دائمًا لتقديم حلول مبتكرة تضيف قيمة حقيقية لعملائنا وتفوق توقعاتهم.",
  "Responsibility": "المسؤولية",
  "We take full responsibility for everything we deliver, committed to meeting our clients’ needs and achieving results that exceed expectations with professionalism and integrity": "نتحمل المسؤولية الكاملة عن كل ما نقدمه، ملتزمين بتلبية احتياجات عملائنا وتحقيق نتائج تفوق التوقعات بكل احترافية وأمانة.",
  "Our Services": "خدماتنــــــا",
  "Find out what services you provide and what distinguishes them": "تعرف على الخدمات التي تقدمها وما الذي يميزها",
  "We provide programming and design services that meet your needs efficiently and innovatively": "نحن نقدم خدمات البرمجة والتصميم التي تلبي احتياجاتك بكفاءة وابتكار",
  "UI & UX Design": "تصميم واجهة المستخدم UI&UX",
  "We provide attractive and user-friendly UI designs, enhancing the user experience for smooth and enjoyable interaction": " نقدم تصميمات واجهات مستخدم جذابة وسهلة الاستخدام، مع تحسين تجربة المستخدم لضمان تفاعل سلس وممتع.",
  "Website Development": "تطوير المواقع الالكترونية",
  "We offer website development services, from design to launch, ensuring an exceptional user experience with fast and secure performance": " خدمات تطوير المواقع الإلكترونية، بدءًا من التصميم حتى الإطلاق، مع ضمان تجربة مستخدم مميزة وأداء سريع وآمن.",
  "Application Development": "تطوير التطبيقات",
  "We offer custom application development services across various platforms, ensuring high performance and an exceptional user experience that meets clients needs": " نقدم خدمات تطوير التطبيقات المخصصة على الأنظمة المختلفة، مع ضمان أداء عالي وتجربة مستخدم متميزة تلبي احتياجات العملاء.",
  "Website and App Testing": "اختبار المواقع و التطبيقات",
  "We provide website and app testing services to ensure smooth performance and error-free functionality, ensuring compatibility across all devices and platforms": " اختبار المواقع والتطبيقات لضمان أداء سلس وخالي من الأخطاء، مع التأكد من توافقها عبر جميع الأجهزة والمنصات.",
  "Project Management": "إدارة المشاريع",
  "We provide project management services by planning, organizing, and overseeing all project stages to ensure efficient execution and timely delivery": "نقدم خدمات إدارة المشاريع من خلال تخطيط وتنظيم ومتابعة كل مراحل المشروع لضمان تنفيذه بكفاءة وفي الوقت المحدد.",
  "Project Development": "تطوير المشاريع",
  "We offer project development services from start to finish, focusing on turning ideas into reality while meeting client needs and ensuring the required quality": "نقدم خدمات تطوير المشاريع من البداية إلى النهاية، مع التركيز على تنفيذ الفكرة وتحويلها إلى واقع، بما يتوافق مع احتياجات العميل والجودة المطلوبة.",
  "Years of Experience": "سنوات من الخبرة",
  "Happy Clients": "عملاء سعداء",
  "Completed Projects": "مشروع مكتمل",
  "Innovating Solutions, Delivering Excellence": "ابتكار الحلول، تقديم التميز",
  "Choose PROGO for Innovation and Excellence": "اختر بروجو للابتكار والتميز",
  "Innovative and Unique Design UI&UX": "تصميم واجهات مستخدم مبتكر وفريد UI & UX",
  "We provide unique and creative designs that reflect your brand’s identity and offer an exceptional user experience": "نحن نقدم تصاميم فريدة ومبتكرة تعكس هوية علامتك التجارية وتوفر تجربة مستخدم استثنائية.",
  "Thorough Security Analysis": "فحص أمني دقيق",
  "We conduct in-depth checks to ensure your data and applications are protected from threats and vulnerabilities": "نقوم بإجراء فحوصات شاملة لضمان حماية بياناتك وتطبيقاتك من التهديدات والثغرات",
  "Continuous follow-up of the project": "متابعة مستمرة للمشروع",
  "We provide a tailored system to track your project’s progress and offer accurate, up-to-date reports": "متابعة تقدم مشروعك وتقديم تقارير دقيقة ومحدثة يمكنك الحصول على رؤى واضحة حول الأداء، التكاليف، والموارد، مما يساعدك في اتخاذ قرارات مستنيرة ",
  "Achieve a breakthrough in your project": "حقق قفزة نوعية في مشروعك",
  "We help propel your project forward with innovative and advanced solutions, delivering outstanding results": "نحن نساعد في دفع مشروعك إلى الأمام من خلال حلول مبتكرة ومتطورة، مقدّمين نتائج متميزة",
  "Scalable Solutions": "حلول قابلة للتوسع",
  "Our custom solutions are scalable to accommodate growth and increase the capacity to handle a larger number of users or data without impacting the speed or stability of the system": "حلولنا المخصصة قابلة للتوسع لاستيعاب النمو وزيادة القدرة على التعامل مع عدد أكبر من المستخدمين أو البيانات دون التأثير على سرعة أو استقرار النظام",
  "Effortless Maintenance, Maximum Performance": "صيانة سهلة، أداء أفضل",
  "Easily maintainable solutions, which means that the system or application we develop will be able to be flexibly updated and modified without affecting its performance": "حلول قابلة للصيانة بسهولة، مما يعني أن النظام أو التطبيق الذي نطوره سيكون قادرًا على التحديث والتعديل بمرونة دون التأثير على أدائه",
  "Reliable Solutions, Uninterrupted Performance": "حلول موثوقة، أداء مستمر",
  "Highly reliable solutions, which means that the system or application we provide will always be available to operate continuously without interruptions or errors": "حلول عالية الموثوقية، مما يعني أن النظام أو التطبيق الذي نقدمه سيكون دائمًا متاحًا للعمل بشكل مستمر دون انقطاع أو أخطاء",
  "Innovating Together, Delivering Success": "معًا نبتكر. معًا نتفوق. معًا نقدم نجاحًا يتجاوز التوقعات",
  "The Progo team consists of a group of skilled professionals specializing in designing and developing innovative software solutions, We work closely together to deliver the best services to our clients, with each team member bringing their expertise and skills to achieve the highest level of performance and quality, We believe in the power of teamwork and place innovation and excellence at the core of every project we undertake": "فريق بروجو يتكون من مجموعة من المهندسين المحترفين المتخصصين في تصميم وتطوير الحلول البرمجية المبتكرة. نحن نعمل بتعاون وثيق لتقديم أفضل الخدمات لعملائنا، حيث يجمع كل عضو في الفريق خبراته ومهاراته لتحقيق أعلى مستوى من الأداء والجودة. نحن نؤمن بقوة العمل الجماعي ونضع الابتكار والتميز في صميم كل مشروع نعمل عليه.",
  "Eid Fathy": "عيد فتحي",
  "Software engineer": "مهندس سوفتوير",
  "Radwan Gaber": "رضوان جابر",
  "Backend Developer": "مطور الواجهة الخلفية",
  "Alaa Eldeyn": "علاء الدين",
  "Frontend Developer": "مطور الواجهة الأمامية",
  "Hossam Said": "حسام سعيد",
  "UI/UX Designer": "مصمم تجربة المستخدم",
  "Our Projects": "أعمالنـــــا",
  "Where Innovation Meets Excellence, Transforming Ideas into Reality": "حيث يلتقي الابتكار بالتميز، ونحوّل الأفكار إلى واقع",
  "Web Application": "ويب ابلكيشن",
  "Mobile App": "تطبيق الجوال",
  "UI/UX Design": "تصميم واجهة المستخدم UI/UX",
  "Dashboard - HR system": "داشبورت - Hr System",
  "Restaurant Mobile App": "تطبيق الهاتف الخاص بالمطعم",
  "Hi Community": "موقع شبكة التواصل الاجتماعي",
  "E-commerce": "متجر الكترونى",
  "internship opportunity - AI": "فرصة تدريب - AI",
  "Dashboard - LibyaZon": "لوحة التحكم - LibyaZon",
  "Online store - Web": "متجر الكترونى - ويب",
  "Online store - App": "متجر الكترونى - تطبيق",
  "Dashboard - E-commerce": "لوحة التحكم - متجر الكترونى",
  "Alarm - Pharmacies system": "Alarm - نظام الصيدليات",
  "Archive system": "نظام الأرشيف",
  "Educational platform": "منصة تعليمية",
  "Private": "خاص",
  "The project timeline": "الجدول الزمني للمشروع",
  "Your Roadmap to Success, Step by Step": "خريطة طريقك نحو النجاح، خطوة بخطوة",
  "Define Needs and Details": "تحديد الاحتياجات والتفاصيل",
  "Identify the project's needs and outline all necessary details to ensure tasks are executed clearly and systematically, achieving objectives efficiently": "تحديد احتياجات المشروع وتوضيح جميع التفاصيل اللازمة لضمان تنفيذ المهام بوضوح ومنهجية، وتحقيق الأهداف بكفاءة.",
  "Research and study the project": "البحث ودراسة المشروع",
  "This phase involves gathering and analyzing information to understand all aspects of the project, define its goals, and identify the requirements needed to achieve it efficiently and effectively": "تتضمن هذه المرحلة جمع وتحليل المعلومات لفهم جميع جوانب المشروع، وتحديد أهدافه، وتحديد المتطلبات اللازمة لتحقيقه بكفاءة وفعالية.",
  "Start planning and defining tasks": "بدء التخطيط وتحديد المهام",
  "In this phase, a comprehensive project plan is developed, outlining the key tasks and assigning them clearly to ensure organized workflow and timely achievement of objectives": "في هذه المرحلة يتم إعداد خطة مشروع شاملة، مع تحديد المهام الرئيسية وتوزيعها بوضوح لضمان سير العمل بشكل منظم وتحقيق الأهداف في الوقت المناسب.",
  "Start Design (UI/UX)": "بدء التصميم (UI/UX)",
  "This stage focuses on creating user-friendly and visually appealing interfaces, It includes designing layouts, selecting styles, and ensuring the best user experience that aligns with the project's goals": "تركز هذه المرحلة على إنشاء واجهات سهلة الاستخدام وجذابة بصريًا، وتشمل تصميم التخطيطات، واختيار الأنماط، وضمان أفضل تجربة مستخدم تتماشى مع أهداف المشروع.",
  "Start Programming": "بدء البرمجة",
  "This phase involves turning designs into functional systems by writing clean, efficient, and scalable code to build the application's core features and functionalities": "تشمل هذه المرحلة تحويل التصاميم إلى أنظمة عملية من خلال كتابة كود نظيف وفعال وقابل للتطوير لبناء الميزات والوظائف الأساسية للتطبيق.",
  "Problem solving and testing stages": "مراحل حل المشكلات والاختبار",
  "In this phase, the project undergoes thorough testing to identify and resolve potential bugs and issues, The goal is to ensure the system operates efficiently and reliably before launch": "في هذه المرحلة، يخضع المشروع لاختبارات شاملة لتحديد وحل الأخطاء والمشكلات المحتملة، بهدف ضمان تشغيل النظام بكفاءة وموثوقية قبل الإطلاق.",
  "Testing the Project for Vulnerabilities": "اختبار المشروع للثغرات الأمنية",
  "This phase involves a detailed examination of the system to identify and address security vulnerabilities, ensuring data protection and system stability": "تتضمن هذه المرحلة فحصًا دقيقًا للنظام لتحديد ومعالجة الثغرات الأمنية، وضمان حماية البيانات واستقرار النظام.",
  "Project launch and management": "إطلاق المشروع وإدارته",
  "After the project is complete, it needs to be deployed and managed properly, This phase includes monitoring, feedback collection, and continuous improvement of the system": "بعد اكتمال المشروع، يجب نشره وإدارته بشكل صحيح، وتشمل هذه المرحلة المراقبة، وجمع الملاحظات، والتحسين المستمر للنظام.",
  "What client says": "بعض آراء عملائنا",
  "Your Opinion Matters, Our Success Depends on It": "رأيك يهمنا، ونجاحنا يعتمد عليه",
  "Honestly, the service was top-notch, The team was professional and helpful, and they didn’t fall short on anything, From the moment we contacted them, they handled everything perfectly, from the website and app design to the smallest details in the dashboard, What really impressed us was how they kept in touch with us continuously and responded to all our inquiries quickly and effectively, The service wasn’t just about executing the project, but even after completion, they were available for any support we needed, In short, what PROGO delivered was beyond our expectations, and we hope for continued collaboration in the future, May God bless you for the excellent service and high professionalism": "بصراحة، كانت الخدمة ممتازة للغاية، الفريق كان محترف ومساعد جدًا، وما قصروا في أي حاجة، من لحظة التواصل معاهم وهم بيهتموا بكل حاجة بشكل مثالي، من تصميم الموقع والتطبيق لأصغر التفاصيل في لوحة التحكم، اللي أبهرنا فعلاً إنهم كانوا على تواصل مستمر معانا وردوا على كل استفساراتنا بسرعة وكفاءة، الخدمة ما كانتش مجرد تنفيذ للمشروع، لكن حتى بعد التسليم كانوا موجودين لأي دعم احتجناه، باختصار، اللي قدمته PROGO كان فوق توقعاتنا، ونتمنى استمرار التعاون في المستقبل، ربنا يبارك لكم في الخدمة الممتازة والمهنية العالية.",
  "Thank you to the Progo team for the amazing design of the Savory Kitchen logo, We thoroughly enjoyed collaborating with you, and the team was incredibly professional in understanding our vision and turning it into a design that perfectly reflects our brand identity, The logo truly represents what we want our customers to see and adds a professional touch to our project, We are excited to work with you again in the future!": "شكرًا لفريق Progo على التصميم الرائع لشعار Savory Kitchen، استمتعنا جدًا بالتعاون معاكم، والفريق كان محترف جدًا في فهم رؤيتنا وتحويلها لتصميم يعكس هوية علامتنا التجارية بشكل مثالي، الشعار بجد بيعبر عن اللي عايزين العملاء يشوفوه وبيضيف لمسة احترافية لمشروعنا، متحمسين للعمل معاكم مرة تانية في المستقبل!",
  "Wa Alaikum Assalam,, The work is truly amazing, thank you for your cooperation with us and for bearing with our brief and delayed responses, We were really busy with work and training, so we apologize, But honestly, the work is impressive and our administrative team loved it, We look forward to continued collaboration, This is our second exhibition, and there will be a third, and God willing, with your participation": "وعليكم السلام، العمل فعلاً رائع، شكرًا لتعاونكم معانا وتحملكم ردودنا القصيرة والمتأخرة، كنا مشغولين جدًا بالشغل والتدريب، فبنعتذر، لكن بصراحة، العمل مميز جدًا وفريقنا الإداري أعجب بيه، منتظرين استمرار التعاون معاكم، ده كان معرضنا الثاني، وهيبقى فيه ثالث إن شاء الله بمشاركتكم.",
  "I would like to thank PROGO for the ’University Market’ project they did for us, The project was an e-commerce platform similar to an open market, along with a dashboard and app, Honestly, the service was excellent, and the team was very cooperative and professional, From the start of the project, they listened to our requirements and understood exactly what we needed, The design was fantastic, and the app was user-friendly, What excited us even more was the continuous support from the team even after the project was delivered, Their work was of the highest quality and precision, and we will definitely continue working with them on our future projects, May God bless them, and they really did an outstanding job": "حابب أشكر PROGO على مشروع ’سوق الجامعة’ اللي عملوه لنا، المشروع كان منصة تجارة إلكترونية شبيهة بالسوق المفتوح، مع لوحة تحكم وتطبيق، بصراحة الخدمة كانت ممتازة جدًا، والفريق كان متعاون ومحترف، من بداية المشروع سمعوا متطلباتنا وفهموا بالضبط اللي محتاجينه، التصميم كان رائع جدًا والتطبيق سهل الاستخدام، اللي أبهرنا أكتر هو الدعم المستمر من الفريق حتى بعد تسليم المشروع، شغلهم كان بجودة ودقة عالية جدًا، وبالتأكيد هنستمر في العمل معاهم في مشاريعنا القادمة، ربنا يبارك فيهم، بجد عملوا شغل رائع.",
  "Thank you to the Progo team for creating a wonderful logo for Chef Hassan Fouad’s pizza brand, The design beautifully blends the 'HS' initials with wheat, symbolizing the personal touch and authentic ingredients that make the chef’s pizza special, Your creativity and attention to detail exceeded our expectations, and we are very excited about the final result, We look forward to working with you again in the future": "شكرًا لفريق Progo على تصميم شعار رائع لعلامة بيتزا الشيف حسن فؤاد، التصميم دمج بشكل جميل بين الحروف 'HS' والقمح، بيعبر عن اللمسة الشخصية والمكونات الأصلية اللي بتخلي البيتزا مميزة، إبداعكم واهتمامكم بالتفاصيل فاق توقعاتنا، ومتحمسين جدًا للنتيجة النهائية، منتظرين العمل معاكم مرة تانية في المستقبل.",
  "Peace and blessings be upon you all, I would like to express my sincere gratitude, appreciation, and respect to all of you for your support, especially to the brilliant engineer and team leader, “Ayd,” the creative engineer behind the scenes and frontend mastermind, “Alaa,” and last but not least, the powerful backend architect, engineer “Redwan,” I am truly grateful for the quality of execution in the first release and am very pleased with our collaboration on this project, It is an honor to work with you all, and I am looking forward to many future collaborations and developments, as well as new additions to the project, Thank you for your professionalism, great communication, understanding, and the speed at which you respond with innovative and advanced solutions, Best regards, Dr, Ali": "السلام عليكم ورحمة الله وبركاته، حابب أعبر عن شكري وامتناني واحترامي لكم جميعًا على دعمكم، خاصة للمهندس العبقري وقائد الفريق ’عيد’، والمهندس المبدع وراء الكواليس وخبير الواجهة الأمامية ’علاء’، وأخيرًا وليس آخرًا، المهندس القوي في البنية التحتية ’رضوان’، ممتن جدًا لجودة التنفيذ في الإصدار الأول وسعيد جدًا بالتعاون معاكم في المشروع، شرف كبير العمل معاكم، ومتحمس لتعاونات مستقبلية كثيرة وتطورات وإضافات جديدة في المشروع، شكرًا على احترافيتكم والتواصل الرائع وفهمكم وسرعة استجابتكم بحلول مبتكرة ومتقدمة، مع أطيب التحيات، د. علي.",
  "Can you cover the software development process from start to finish?": "هل يمكنك تغطية عملية تطوير البرمجيات من البداية إلى النهاية؟",
  "Certainly! This is our core service, We are a specialized software design and development company, capable of providing end-to-end coverage of the software development process, We have a strong team of IT experts, including consultants, engineers, and developers, who are responsible for all aspects of software development, from gathering and deriving requirements to software design, programming, deployment, and support": "بالتأكيد! هذه هي خدمتنا الأساسية. نحن شركة متخصصة في تصميم وتطوير البرمجيات، قادرة على توفير تغطية من البداية إلى النهاية لعملية تطوير البرمجيات. لدينا فريق قوي من خبراء تكنولوجيا المعلومات، بما في ذلك الاستشاريين والمهندسين والمطورين، الذين يتولون مسؤولية جميع جوانب تطوير البرمجيات، بدءًا من جمع واستقلال المتطلبات إلى تصميم البرمجيات وبرمجتها ونشرها ودعمها",
  "Yes, you can get your software quickly, Depending on the project's size, we can deliver the Minimum Viable Product (MVP) within a timeframe ranging from one month to four months, Get in touch with us, and we'll meet your needs with professionalism and precision,": "نعم، يمكنك الحصول على البرمجيات بسرعة. اعتمادًا على حجم المشروع، يمكننا تقديم المنتج الأدنى القابل للاستخدام (MVP) في الوقت المحدد الذي يتراوح بين شهر واحد وأربعة أشهر. تواصل معنا، وسنلبي احتياجاتك بكفاءة ودقة.",
  "The costs of developing medium to large-scale software applications typically range from $2,000 to $15,000 USD, The total cost primarily depends on the number of software features and their complexity, the number of supported core systems (web, mobile, desktop), and the type of development (custom development, low-code development, platform-based development), Additionally, the uniqueness and complexity of user interface design, the number of software integration processes, as well as requirements for availability, security, and performance, also play a significant role in determining the development cost,<br> You can request a project cost estimate for free from Progo or learn more details about software development costs in our recently published guide,": "تتراوح تكاليف تطوير تطبيقات البرمجيات ذات المقياس المتوسط إلى الكبير عادةً بين 2000 و 15000 دولار أمريكي. تعتمد التكلفة الإجمالية في المقام الأول على عدد ميزات البرمجيات وتعقيدها، وعدد الأنظمة الأساسية المدعومة (الويب، الجوال، سطح المكتب)، ونوع التطوير (تطوير مخصص، تطوير منخفض الكود، تطوير قائم على النظام). بالإضافة إلى ذلك، تلعب فرادة وتعقيد تصميم واجهة المستخدم، وعدد عمليات تكامل البرمجيات، فضلاً عن متطلبات التوفر والأمان والأداء، دورًا كبيرًا في تحديد تكلفة التطوير. يمكنك طلب تقدير تكلفة المشروع مجانًا من Progo أو معرفة المزيد من التفاصيل حول تكاليف تطوير البرمجيات في دليلنا الذي نشرناه مؤخرًا.",
  "Ensuring the Quality of Our Software We ensure the quality of the software we provide through several measures and practices, including:<li><strong>Adherence to standard development practices:</strong> We adhere to international development standards and best practices in the software development industry,</li><li><strong>Quality testing:</strong> We conduct comprehensive software testing using a variety of software testing techniques to ensure its correct performance according to the required specifications,</li><li><strong>Code review:</strong> Our team regularly reviews the written code to ensure its quality and compliance with best practices and standards,</li><li><strong>Adoption of the development lifecycle:</strong> We follow regular and organized development processes and establish clear plans for project management and monitoring,</li><li><strong>Continuous improvement:</strong> We continue to provide continuous improvements to the software based on customer feedback and user experiences,</li><li><strong>Commitment to security:</strong> We ensure the security of the software through secure development practices and continuous security testing,</li>    Through these measures and practices, we strive to deliver high-quality software that meets the needs of our customers and exceeds their expectations,": "ضمان جودة برامجنا نحن نضمن جودة البرامج التي نقدمها من خلال عدة تدابير وممارسات، بما في ذلك:<li><strong>الالتزام بممارسات التطوير القياسية:</strong> نحن نلتزم بالمعايير الدولية والممارسات الفضلى في صناعة تطوير البرمجيات.</li><li><strong>اختبار الجودة:</strong> نقوم بإجراء اختبارات شاملة للبرمجيات باستخدام مجموعة متنوعة من تقنيات اختبار البرمجيات لضمان أدائها الصحيح وفقًا للمواصفات المطلوبة.</li><li><strong>مراجعة الشيفرة:</strong> يقوم فريقنا بمراجعة الشيفرة المكتوبة بانتظام لضمان جودتها وامتثالها للممارسات والمعايير الفضلى.</li><li><strong>اعتماد دورة حياة التطوير:</strong> نتبع عمليات تطوير منتظمة ومنظمة ونضع خططًا واضحة لإدارة المشاريع والمراقبة.</li><li><strong>التحسين المستمر:</strong> نستمر في تقديم تحسينات مستمرة للبرمجيات بناءً على ملاحظات العملاء وتجارب المستخدمين.</li><li><strong>الالتزام بالأمان:</strong> نضمن أمان البرمجيات من خلال ممارسات تطوير آمنة واختبارات أمان مستمرة.</li> من خلال هذه التدابير والممارسات، نسعى لتقديم برمجيات عالية الجودة تلبي احتياجات عملائنا وتتجاوز توقعاتهم.",
  "During the first 3 months after software deployment, our team does the following:<br>Responds to your inquiries and user questions, and resolves any user issues (if any),<br>Provides support related to incident management, configuration changes, and updates, After the initial 3-month period, and upon agreement, we offer continuous maintenance and upgrades for your software, in addition to providing on-demand support from Level 1 to Level 3, We have extensive experience in fostering long-term partnerships and ensuring our clients' long-term satisfaction": "خلال الأشهر الثلاثة الأولى بعد نشر البرمجيات، يقوم فريقنا بما يلي:<br>يستجيب لاستفساراتك وأسئلة المستخدمين، ويحل أي مشاكل تواجه المستخدمين (إن وجدت).<br>يقدم الدعم المتعلق بإدارة الحوادث وتغييرات التكوين والتحديثات. بعد الفترة الأولى لمدة 3 أشهر، وبناءً على الاتفاق، نقدم صيانة مستمرة وترقيات لبرمجياتك، بالإضافة إلى تقديم الدعم حسب الطلب من المستوى 1 إلى المستوى 3. لدينا خبرة واسعة في تعزيز الشراكات طويلة الأمد وضمان رضا عملائنا طويل الأمد.",
  "The average time required to create your profile depends on several factors, including the size of your company and the specific market requirements relevant to your business, We provide detailed estimates based on initial consultation with our clients,": "الوقت المتوسط اللازم لإنشاء ملف تعريفك يعتمد على عدة عوامل، بما في ذلك حجم شركتك ومتطلبات السوق المحددة ذات الصلة بنشاطك التجاري. نقدم تقديرات مفصلة استنادًا إلى الاستشارة الأولية مع عملائنا.",
  "Can we get the software quickly?": "هل يمكننا الحصول على البرمجيات بسرعة؟",
  "What is the cost of software development?": "ما هو تكلفة تطوير البرمجيات؟",
  "What are your policies for post-launch?": "ما هي سياساتكم لما بعد الإطلاق؟",
  "How do you ensure the quality of the software you provide?": "كيف تضمن جودة البرمجيات التي تقدمها؟",
  "What is the average time required to create a complete profile for my company?": "ما هو الوقت المتوسط اللازم لإنشاء ملف تعريف كامل لشركتي؟",
  "Frequently asked questions": "الأسئلة المتداولة",
  "If you have any other questions, you can contact me by email": "إذا كان لديك أي أسئلة أخرى، يمكنك التواصل معي عبر البريد الإلكتروني",
  "Yes, you can get your software quickly, Depending on the projects size, we can deliver the Minimum Viable Product (MVP) within a time frame ranging from one month to four months, Get in touch with us, and we will meet your needs with professionalism and precision,": "نعم، يمكنك الحصول على البرمجيات بسرعة. اعتمادًا على حجم المشروع، يمكننا تقديم المنتج الأدنى القابل للاستخدام (MVP) في الوقت المحدد الذي يتراوح بين شهر واحد وأربعة أشهر. تواصل معنا، وسنلبي احتياجاتك بكفاءة ودقة.",
  "You have a project in Your mind! Contact us now": "لديك مشروع في ذهنك! اتصل بنا الآن.",
  "Get in touch": "تواصل معنا",
  "Email us": "راسلنا عبر البريد الإلكتروني",
  "Phone Number": "رقم الهاتف",
  "Address": "العنوان",
  "Eldoqi - Hadaiq Elahram": "الدقي - حدائق الاهرام",
  "Connect with us :": "تواصل معنا :",
  "Name": "الاسم",
  "Email": "البريد الإلكتروني",
  "Company Name": "اسم الشركة / المؤسسة",
  "Subject": "الموضوع",
  "Message": "الرسالة",
  "Send": "إرسال",
  "Name is required": "الاسم مطلوب",
  "Invalid email": "البريد الإلكتروني غير صحيح",
  "Invalid phone number": "رقم الهاتف غير صحيح",
  "Message is required": "الرسالة مطلوبة",
  "Sending": "جاري الإرسال...",
  "Send Message": "إرسال الرسالة",
  "Message sent successfully!": "تم إرسال الرسالة بنجاح!",
  "Tell us about your project": "أخبرنا عن مشروعك...",
  "Brand/Company/Product Name": "اسم العلامة التجارية / الشركة / المنتج",
  "Email address": "عنوان البريد الإلكتروني",
  "Full name": "الاسم الكامل",
  "send message": "إرسال الرسالة",
  " ": " ",
  "A software development company specializing in providing innovative and customized solutions to meet clients' needs, including designing and developing applications and websites, as well as creating integrated business systems, We strive to deliver quality and efficiency to ensure the success of our clients' projects": "شركة تطوير برمجيات متخصصة في تقديم حلول مبتكرة ومخصصة لتلبية احتياجات العملاء، بما في ذلك تصميم وتطوير التطبيقات والمواقع الإلكترونية، بالإضافة إلى إنشاء أنظمة أعمال متكاملة. نحن نسعى جاهدين لتقديم الجودة والكفاءة لضمان نجاح مشاريع عملائنا.",
  "Site Links": "روابط الموقع",
  "Product": "المنتج",
  "Figma": "فيجما",
  "Adobe": "أدوبي",
  "Dribbble": "دريبل",
  "Behance": "بيهانس",
  "Progo team": "تيم بروجو"
}
